/* grade average badge ipad */
"%.0f" = "%.0f";

/* class detail weight */
"%.0f%%" = "%.0f%%";

/* category detail average */
"%.2f%%" = "%.2f%%";

/* relative date hours ago */
"%d hours ago" = "%d hours ago";

/* relative date minutes ago */
"%d minutes ago" = "%d minutes ago";

/* assignment grade in table out of 100 */
"%u" = "%u";

/* assignment grade in table not out of 100 */
"%u/%u" = "%1$u/%2$u";

/* relative date yesterday */
"'Yesterday at' h:mm a" = "'Yesterday at' h:mm a";

/* shown with empty grade in category table */
"-" = "-";

/* relative date hours ago */
"1 hour ago" = "1 hour ago";

/* relative date minutes ago */
"1 minute ago" = "1 minute ago";

/* settings */
"About QuickHAC" = "About QuickHAC";

/* settings */
"About QuickHAC…" = "About QuickHAC…";

/* settings */
"Acknowledgements" = "Acknowledgements";

/* settings footer */
"QuickHAC Version %@ (build %@)" = "QuickHAC Version %@ (build %@)";

/* No comment provided by engineer. */
"Add Student" = "Add Student";

/* No comment provided by engineer. */
"Add Student…" = "Add Student…";

/* No comment provided by engineer. */
"Adding students" = "Adding students";

/* No comment provided by engineer. */
"All students on the account '%@' have already been added to QuickHAC.\nUse the sidebar to switch between them." = "All students on the account '%@' have already been added to QuickHAC.\nUse the sidebar to switch between them.";

/* class detail */
"ASSIGNMENT" = "ASSIGNMENT";

/* No comment provided by engineer. */
"Average" = "Average";

/* category detail */
"AVERAGE" = "AVERAGE";

/* No comment provided by engineer. */
"Calculated GPA may not be accurate. We are not responsible for any problems arising from inaccurate calculations." = "Calculated GPA may not be accurate. We are not responsible for any problems arising from inaccurate calculations.";

/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Change" = "Change";

/* No comment provided by engineer. */
"Change District" = "Change District";

/* No comment provided by engineer. */
"Changing Student" = "Changing Student";

/* No comment provided by engineer. */
"Changing Student…" = "Changing Student…";

/* No comment provided by engineer. */
"COURSES" = "COURSES";

/* sidebar section header */
"Courses" = "Courses";

/* class detail
   class info
   cycle selector */
"Cycle %u" = "Cycle %u";

/* No comment provided by engineer. */
"Cycles" = "Cycles";

/* No comment provided by engineer. */
"Dashboard" = "Dashboard";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* No comment provided by engineer. */
"Disable" = "Disable";

/* No comment provided by engineer. */
"Dismiss" = "Dismiss";

/* No comment provided by engineer. */
"District: %@" = "District: %@";

/* No comment provided by engineer. */
"Done" = "Done";

/* relative date last week */
"EEEE 'at' h:mm a" = "EEEE 'at' h:mm a";

/* class grades */
"Error" = "Error";

/* No comment provided by engineer. */
"Error Authenticating" = "Error Authenticating";

/* No comment provided by engineer. */
"Error Fetching Grades" = "Error Fetching Grades";

/* No comment provided by engineer. */
"Error Logging In" = "Error Logging In";

/* No comment provided by engineer. */
"Error Selecting Student" = "Error Selecting Student";

/* No comment provided by engineer. */
"Error Updating Grades" = "Error Updating Grades";

/* No comment provided by engineer. */
"Exam" = "Exam";

/* No comment provided by engineer. */
"Exc" = "Exc";

/* No comment provided by engineer. */
"Excluded Courses" = "Excluded Courses";

/* settings */
"Feedback" = "Feedback";

/* settings */
"General" = "General";

/* No comment provided by engineer. */
"GPA" = "GPA";

/* No comment provided by engineer. */
"GPA Precision" = "GPA Precision";

/* No comment provided by engineer. */
"GPA Settings" = "GPA Settings";

/* The first %%.%1$uf is unweighted, the second is weighted GPA. */
"GPA: %%.%1$uf/%%.%1$uf" = "GPA: %%.%1$uf/%%.%1$uf";

/* class detail */
"GRADE" = "GRADE";

/* No comment provided by engineer. */
"Grade Colourisation" = "Grade Colourisation";

/* class grades */
"Grades Updated" = "Grades Updated";

/* No comment provided by engineer. */
"HAC Password" = "HAC Password";

/* No comment provided by engineer. */
"HAC Username" = "HAC Username";

/* No comment provided by engineer. */
"Help" = "Help";

/* No comment provided by engineer. */
"Honours Courses" = "Honours Courses";

/* No comment provided by engineer. */
"Hue" = "Hue";

/* student selector */
"ID: %@" = "ID: %@";

/* settings */
"Import & Export" = "Import & Export";

/* No comment provided by engineer. */
"Invalid Credentials" = "Invalid Credentials";

/* No comment provided by engineer. */
"Invalid District" = "Invalid District";

/* No comment provided by engineer. */
"Invalid Password" = "Invalid Password";

/* No comment provided by engineer. */
"Invalid Username" = "Invalid Username";

/* relative date less than one minute ago */
"Just now" = "Just now";

/* relative date */
"LLLL d, yyyy" = "LLLL d, yyyy";

/* login screen */
"Log In" = "Log In";

/* No comment provided by engineer. */
"Log Out" = "Log Out";

/* No comment provided by engineer. */
"Logging In…" = "Logging In…";

/* No comment provided by engineer. */
"Lost your password?" = "Lost your password?";

/* No comment provided by engineer. */
"Manage Courses…" = "Manage Courses…";

/* relative date last year */
"MMMM d" = "MMMM d";

/* relative date last month */
"MMMM d 'at' h:mm a" = "MMMM d 'at' h:mm a";

/* No comment provided by engineer. */
"MORE" = "MORE";

/* class detail */
"No Assignments in This Category" = "No Assignments in This Category";

/* No comment provided by engineer. */
"No data is available for the selected cycle." = "No data is available for the selected cycle.";

/* No comment provided by engineer. */
"No District Selected" = "No District Selected";

/* No comment provided by engineer. */
"No Grades" = "No Grades";

/* No comment provided by engineer. */
"No Grades Available" = "No Grades Available";

/* No comment provided by engineer. */
"No Students" = "No Students";

/* No comment provided by engineer. */
"Not Connected" = "Not Connected";

/* sidebar item */
"Overview" = "Overview";

/* No comment provided by engineer. */
"Passcode" = "Passcode";

/* login view controller placeholder */
"Password" = "Password";

/* No comment provided by engineer. */
"Please enter a valid password." = "Please enter a valid password.";

/* No comment provided by engineer. */
"Please enter a valid username." = "Please enter a valid username.";

/* No comment provided by engineer. */
"Power Level" = "Power Level";

/* No comment provided by engineer. */
"Preferences" = "Preferences";

/* login screen */
"QuickHAC" = "QuickHAC";

/* No comment provided by engineer. */
"Report Issue" = "Report Issue";

/* settings */
"Security" = "Security";

/* No comment provided by engineer. */
"Select District…" = "Select District…";

/* No comment provided by engineer. */
"Select School District" = "Select School District";

/* No comment provided by engineer. */
"Select Student" = "Select Student";

/* No comment provided by engineer. */
"Semester %u" = "Semester %u";

/* No comment provided by engineer. */
"Set Up" = "Set Up";

/* No comment provided by engineer. */
"Settings" = "Settings";

/* No comment provided by engineer. */
"Sign Out" = "Sign Out";

/* No comment provided by engineer. */
"Something happened." = "Something happened.";

/* No comment provided by engineer. */
"Student ID: %@ — %@" = "Student ID: %1$@ — %2$@";

/* settings */
"Students" = "Students";

/* No comment provided by engineer. */
"The disambiguation process failed." = "The disambiguation process failed.";

/* No comment provided by engineer. */
"The gradebook returned invalid data." = "The gradebook returned invalid data.";

/* No comment provided by engineer. */
"The login was rejected." = "The login was rejected.";

/* No comment provided by engineer. */
"The student record selected is not using a district supported by qHAC." = "The student record selected is not using a district supported by qHAC.";

/* no cycles with data alert */
"There is no data available in the gradebook for the course %@.\nPlease check again later, or consult %@." = "There is no data available in the gradebook for the course %1$@.\nPlease check again later, or consult %2$@.";

/* No comment provided by engineer. */
"To refresh grades for this cycle, please connect to the Internet, and then ensure that you have unrestricted access to the district's gradebook." = "To refresh grades for this cycle, please connect to the Internet, and then ensure that you have unrestricted access to the district's gradebook.";

/* No comment provided by engineer. */
"To refresh the overview, please connect to the Internet, and then ensure that you have unrestricted access to the district's gradebook." = "To refresh the overview, please connect to the Internet, and then ensure that you have unrestricted access to the district's gradebook.";

/* relative date grades refresh control */
"Updated %@" = "Updated %@";

/* No comment provided by engineer. */
"Updating Grades" = "Updating Grades";

/* class detail HUD when loading grades for first time */
"Updating Grades…" = "Updating Grades…";

/* login view controller placeholder */
"Username" = "Username";

/* No comment provided by engineer. */
"Welcome to\nQuickHAC" = "Welcome to\nQuickHAC";

/* No comment provided by engineer. */
"Wrong Credentials" = "Wrong Credentials";

/* No comment provided by engineer. */
"x%.1f" = "x%.1f";

/* No comment provided by engineer. */
"You currently have a passcode set up for QuickHAC on this device." = "You currently have a passcode set up for QuickHAC on this device.";

/* No comment provided by engineer. */
"You do not have a passcode set up." = "You do not have a passcode set up.";

/* No comment provided by engineer. */
"You need to select a district before you can log in.\n\nTap the arrow at the top of the form to bring up a list of supported districts." = "You need to select a district before you can log in.\n\nTap the arrow at the top of the form to bring up a list of supported districts.";

/* No comment provided by engineer. */
"You selected %@." = "You selected %@.";

/* No comment provided by engineer. */
"Your username or password were rejected by HAC. Please update your password, if it was changed, and try again." = "Your username or password were rejected by HAC. Please update your password, if it was changed, and try again.";

